{
    "sampling method":{
        "question": "What sampling method is used in the paper?",
        "answer_prefix": "The sampling method used in the paper is:",
        "context": "sampling methods are used to select a representative subset from a dataset. They are often used to reduce the size of the dataset while maintaining its diversity and characteristics.",
        "some_possible_answers": "Randon sampling, Stratified sampling, Systematic sampling, Cluster sampling, Convenience sampling, Purposive sampling, Snowball sampling, Oversampling, Undersampling and etc... .",
        "text_example": "The preliminary analysis entails choosing an acceptable sample strategy because the dataset is severely imbalanced. Undersampling, Oversampling, and ROSE sampling approaches were tested for this objective. ",
        "text_example_answare": "Undersampling, Oversampling, and ROSE",
        "output_format": "comma separated list" 
    },
    "dataset":{
        "question": "What dataset is used in the paper?",
        "answer_prefix": "The dataset used in the paper is:",
        "context": "Datasets are collections of data that are used for analysis, training machine learning models, or other purposes. They can vary widely in size, structure, and content.",
        "some_possible_answers": "Image datasets, Text datasets, Audio datasets, Video datasets, Tabular datasets and etc..., they could have different formats such as CSV, JSON, XML, or SQL databases.",
        "text_example": "This paper introduces the EMNIST dataset and then ap- plies two ELM-based neural networks to the classification tasks made possible with the complete NIST dataset. Th",
        "text_example_answare": "EMNIST, NIST",
        "output_format": "comma separated list"
    },
    "technique":{
        "question": "What learning algorithms are used in the paper?",
        "answer_prefix": "The learning algorithms used in the paper are:",
        "context": "learning algorithms refer to the methods or approaches used in the Machine Learning field to solve specific problems or tasks. They are normally categorized in supervised learning (classification, regression), unsupervised learning (clustering, dimensionality reduction)",
        "some_possible_answers": "Decision Trees, Support Vector Machines, Neural Networks, k-Nearest Neighbors, Random Forests, Gradient Boosting Machines",
        "text_example": "Support Vector Machine (SVM) is a tool to find the hyper-plane that can be used for classification; ",
        "text_example_answare": "suport vector machine(SVM), ",
        "output_format": "comma separated list"
    },
    "partition method":{
        "question": "What partition method is used in the paper?",
        "answer_prefix": "The partition method used in the paper is:",
        "context": "partition methods are used to divide a dataset into subsets for training, validation, and testing. They help in evaluating the performance of machine learning models by ensuring that the model is tested on unseen data.",
        "some_possible_answers": "Holdout method, k-Fold Cross-Validation, Stratified k-Fold Cross-Validation, Leave-One-Out Cross-Validation (LOOCV), Time Series Split and etc... .",
        "text_example": "2.3.2. Random ForestRandom Forest is an ensemble learning method for both classification and regressiontasks.  Two forced partition methods were employed:the percentile method and the k-means method.Ap were subsequently categorizedinto the same final cluster.",
        "text_example_answare": "percentile method, k-means method",
        "output_format": "comma separated list"
    },
    "evaluation metric":{
        "question": "What evaluation metric is used in the paper?",
        "answer_prefix": "The evaluation metric used in the paper is:",
        "context": "evaluation metrics are used to assess the performance of machine learning models. They provide a quantitative measure of how well a model performs on a given task.",
        "some_possible_answers": "accuracy, precision, recall, F1-score, ROC-AUC, mean absolute error(MAE), and mean squared error(MSE). and etc... .",
        "text_example": "A. Evaluation IndicatorsWidely used indicators are Precision as in (1) and Recallas in (2).Precision=TP/(TP+FP) (1)Recall=TP(TP+FN) (2)where:TP: corresponds to the number of positive examplescorrectly predicted by classifier.FN: corresponds to the number of positive exampleswrongly predicted as negative by classifier.FP: corresponds to the number of negative exampleswrongly predicted as positive by classifier.TN: corresponds to the number of negative examplescorrectly predicted as negative by classifier.",
        "text_example_answare": "precision, recall",
        "output_format": "comma separated list"
    }
}